class Constants:

    DISCO_QUOTES = [
        "А не пойти ли тебе нахер прямо сейчас, а?",
        "Я не *просто* расист. Слушай, я читал *книги*.",
        "Если бы вы знали как Куно похуй, вы бы расплакались.",
        "Твое отличие от фашиста разве что на рентгене можно разглядеть...",
        "Отправляйтесь на планету тусовок. Вы любите наркотики, и это взаимно.",
        "Вот теперь она напугана. Поняла, что правда имеет дело с умственно неполноценным.",
        "Конечно, я не терял свою тушку... То есть пушку! Бляха... Не терял я свой пистолет!",
        "ОТЛИЧНО ПОДОЙДЕТ ПТИЦАМ ВЫСОКОГО ПОЛЕТА. ЛЮБИТЕЛЯМ ТУСОВОК. КОПАМ, КОТОРЫМ НУЖНА ИСКРА.",
        "Я же тебе говорил, боров. Куно не торчит в захолустье. Куно бывал в таких местах, о которых ты и мечтать не мог."
        "Это и есть настоящая тьма. Не смерть, не война, не насилие над детьми. У настоящей тьмы лицо любви. Первая смерть случается в сердце, Гарри.",
        "Внутренняя империя[Просто: Успех] Отбой! Ты это явно не подумавши. То, что ты там увидишь, тебе не понравится — а развидеть это ты уже не сможешь.",
    ]

    BROOKLYN_99_QUOTES = [
        "Ты че болен?",
        "Вызывайте дурку!",
        "Да ну тебя нахуй",
        "Братан, ты поехавший блять",
        "Что это такое и зачем мне это нужно?",
        "Если бы ты знал как мне похуй, ты бы расплакался.",
        "Твое отличие от фашиста разве что на рентгене можно разглядеть...",
    ]

    DICE_IMAGE_MAPPING = {
        1: [
            "https://media1.tenor.com/m/0TMZcbEDsusAAAAd/baldur%27s-gate-3-critical-fail.gif",
            "https://media1.tenor.com/m/43OhyWnm9CcAAAAd/critical-failure-baldur%27s-gate-3.gif",
        ],
        6: [
            "https://www.richardhughesjones.com/wp-content/uploads/2019/01/dice-gif.gif",
            "https://hellfiredesigns.wordpress.com/wp-content/uploads/2012/09/rollin_d61.gif",
        ],
        20: [
            "https://i.postimg.cc/QCpvqpJ1/1.gif",
            "https://images.stopgame.ru/uploads/images/210114/form/2017/01/09/1483964682.gif",
        ],
    }


constant: Constants = Constants()
